{"title":"AP Computer Science Principles Exam Prep","cards":{"c0": {"a":"Innovation","q":"a novel or improved idea, device, product, etc. or the development thereof"},"c1": {"a":"Prototype","q":"A preliminary sketch of an idea or model for something new. It^s the original drawing from which something real might be built or created."},"c2": {"a":"Bit","q":"A contraction of ^^Binary Digits^^. A bit is the single unit of information in a computer, typically represented as 0 or 1."},"c3": {"a":"Binary","q":"A way of representing information using only two options."},"c4": {"a":"Bandwidth","q":"maximum transmission capacity of the device expressed typically in metric multiples of bits per second"},"c5": {"a":"Bit Rate","q":"The numbers of Bits that are conveyed or processed per unit of time. EX: 8bits/per second."},"c6": {"a":"Latency","q":"the amount of time it takes for a bit to travel from sender to receiver"},"c7": {"a":"Protocol","q":"A set of rules governing the exchange or transmission of data between devices."},"c8": {"a":"American Standard Code for Information Interchange (ASCII)","q":"The universally recognized raw text format that any computer can understand."},"c9": {"a":"Code","q":"To write instructions for a computer."},"c10": {"a":"Requests for Comments (RFC)","q":"Documents are how standards and protocols are defined and published for all to see on the IETF website."},"c11": {"a":"Internet","q":"a tangible physical system that is made to move information"},"c12": {"a":"IP Address","q":"A number assigned to any item that is connected to the internet."},"c13": {"a":"Packets","q":"small chunks of information that have been carefully formed from larger chunks of information for the purpose of transmitting through a network"},"c14": {"a":"Router","q":"A computer which receives messages travelling across a network and redirects them towards their intended destinations based on the addressing information included with the messages."},"c15": {"a":"Transmission Control Protocol (TCP)","q":"Provides reliable, ordered, and error-checked delivery of a stream of packets on the internet. TCP is tightly linked with IP and is usually seen as TCP/IP in writing."},"c16": {"a":"Domain named system (DNS)","q":"The internet^s system for converting alphabetic names into numeric IP addresses."},"c17": {"a":"Hypertext Transfer Protocol (HTTP)","q":"Is the protocol used by the world wide web. It describes how messages are formatted and interchanged, and how web servers respond to commands."},"c18": {"a":"Abstractions","q":"Reducing information and detail to focus on essential characteristics."},"c19": {"a":"Server","q":"A computer that awaits and responds to requests for data."},"c20": {"a":"Client","q":"A computer that requests data stored on a computer."},"c21": {"a":"HTTPS","q":"a protocol for secure communication over a computer network which is widely used on the Internet."},"c22": {"a":"Digital Certificate","q":"an electronic document used to prove ownership of a public key."},"c23": {"a":"DDoS","q":"pertaining to or being an incident in which a network of computers floods an online resource with high levels of unwanted traffic so that it is inaccessible to legitimate service requests"},"c24": {"a":"HTTP Request","q":"When you type a URL in your browser, your computer (the client) needs to ^^ask^^ the server that is storing the data and images for the web page to return its contents so your browser can display it."},"c25": {"a":"HTTP Response","q":"When a server receives an HTTP request it will respond with a message of its own. Once again, the response will be sent entirely in ASCII-text and must be correctly formatted."},"c26": {"a":"Electricity, light and radio waves","q":"3 ways we send information"},"c27": {"a":"Fiber optic cable","q":"a thread of glass engineered to reflect light"},"c28": {"a":"URL","q":"an easy-to-remember address for calling a web page (like www.code.org)"},"c29": {"a":"Net Neutrality","q":"the principle that all Internet traffic should be treated equally by Internet Service Providers"},"c30": {"a":"Byte","q":"8 bits"},"c31": {"a":"Nibble","q":"4 bits"},"c32": {"a":"Heuristic","q":"a problem solving approach (algorithm) to find a satisfactory solution where finding an optimal or exact solution is impractical or impossible"},"c33": {"a":"Lossless","q":"a data compression algorithm that allows the original data to be perfectly reconstructed from the compressed data"},"c34": {"a":"Image","q":"A type of data used for graphics or pictures"},"c35": {"a":"Metadata","q":"data that describes other data. For example, a digital image my include metadata that describe the size of the image, number of colors, or resolution"},"c36": {"a":"Pixel","q":"short for ^^picture element^^ it is the fundamental unit of a digital image, typically a tiny square or dot which contains a single point of color of a larger image"},"c37": {"a":"RGB","q":"color model using varying intensities of red, green, and blue to produce colors"},"c38": {"a":"Lossy","q":"data compression method that uses inexact approximations, discarding some data to represent the content"},"c39": {"a":"Abstraction","q":"pulling out specific differences to make one solution work for multiple problems"},"c40": {"a":"Aggregation","q":"a computation in which rows from a data set are grouped together and used to compute a single value of more significant meaning or measurement. i.e. Average, Count, Sum"},"c41": {"a":"Pivot Table","q":"in most spreadsheet software it is the name of the tool used to create summary tables"},"c42": {"a":"Adware","q":"A form of spyware. Collects information about the user or user activities in order to display advertisements in a web browser."},"c43": {"a":"Algorithm","q":"A set of instructions for solving a problem."},"c44": {"a":"Application","q":"Refers to a complete and self-contained program that helps the user accomplish a specific task."},"c45": {"a":"Artificial Intelligence","q":"A branch of computer science with the focus on how to endow computers with capabilities of human intelligence. Can be seen as an attempt to model aspects of human thought on computers"},"c46": {"a":"Autoresponder","q":"A program that automatically delivers information"},"c47": {"a":"Backup and Recovery","q":"The combination of procedures that can restore lost data in the event of hardware or software failure"},"c48": {"a":"Backward Compatible","q":"Refers to the new versions of software or hardware that is compatible with earlier models or versions of the same product."},"c49": {"a":"Bandwidth","q":"Measures how much data you can send in a given amount of time."},"c50": {"a":"Bit","q":"Also called binary digit, it refers to a digit number, either a 0 or a 1."},"c51": {"a":"Bookmark","q":"A facility for marking a specific place in electronic documentation to enable easy return to it. It is used in several types of software, including PDF files, electronic help files and tutorials within a program or online."},"c52": {"a":"Bug","q":"An error, flaw, mistake, failure, or fault in a computer program that prevents it from working as intended, or produces an incorrect result."},"c53": {"a":"Byte","q":"Is equal to eight bits."},"c54": {"a":"C Programming Language","q":"A general-purpose, procedural, imperative computer programming language developed in the early 1970s by Dennis Ritchie for use on the Unix operating system."},"c55": {"a":"Client","q":"A piece of computer hardware or software that accesses a service made available by a server."},"c56": {"a":"Cloud Computing","q":"Shared computing services provided on demand by computers accessed over the Internet."},"c57": {"a":"Code","q":"Programming Instructions."},"c58": {"a":"Compatible","q":"Refers to the ability of one device or program to work with another device or program."},"c59": {"a":"Computational Science","q":"The field of study concerned with constructing mathematical models and numerical solution techniques and using computers to analyze and solve scientific and engineering problems."},"c60": {"a":"Computer Animation","q":"Also known as Computer generated imagery (CGI), it is the art of creating moving images via the use of computers."},"c61": {"a":"Computer Science","q":"An academic field that studies the theoretical foundations of information and computation and their implementation and application in computer systems."},"c62": {"a":"Configuration","q":"The way a system is set up, or the assortment of components that make up the system. Can refer to either hardware or software, or the combination of both."},"c63": {"a":"Copyright","q":"A set of exclusive rights regulating the use of a particular expression of an idea or information, including but not limited to art designs, computer software, books, documents etc."},"c64": {"a":"Cyber Security","q":"Measures taken to protect a computer or computer system against unauthorized access or attack."},"c65": {"a":"Daemon","q":"A computer program that runs in the background, rather than under the direct control of a user; they are usually instantiated as processes."},"c66": {"a":"Data","q":"Information stored on a computer."},"c67": {"a":"Data Cleansing","q":"The process of detecting and removing and/or correcting a database to increase data accuracy, reduce redundancy and enhance consistency of different sets of data that have been merged from separate databases."},"c68": {"a":"Dehardwarization","q":"Refers to the trend in design of new computer hardware which tends to eliminate as many hardware components as possible and supplanting their functionality with software."},"c69": {"a":"Domain Name Service","q":"A directory service that maps names to IP addresses."},"c70": {"a":"Domain Name","q":"The part of the URL that identifies a particular web page."},"c71": {"a":"Grayware","q":"Refers to a malicious software or code that is considered to fall in the ^^grey area^^ between normal software and a virus. A term for which all other malicious or annoying software such as adware, spyware, trackware, and other malicious code and malicious shareware fall under."},"c72": {"a":"Hacker","q":"A person who uses technology to gain unauthorized access to data."},"c73": {"a":"Hardware","q":"A set of physical computer objects. Like a mouse."},"c74": {"a":"Host Computer","q":"A centralized server that delivers specific services to other networked computers."},"c75": {"a":"HTTP","q":"The protocol by a browser program to communicate with a server program over the Internet."},"c76": {"a":"Icon","q":"A visual display of a program."},"c77": {"a":"Information Technology (IT TECH)","q":"A broad subject concerned with technology and other aspects of managing and processing information, especially in large organizations. In particular, it deals with the use of electronic computers and computer software to convert, store, protect, process, transmit, and retrieve information."},"c78": {"a":"Interface","q":"A defined means for a system to communicate with other systems. It is a boundary between a system and its environment providing ways of providing the system inputs and receiving outputs."},"c79": {"a":"Internet","q":"A network that accommodates several computers to facilitate exchange and transfer of data."},"c80": {"a":"IP","q":"Packet delivery through an IP address to identify packets that include both a header and the message data itself."},"c81": {"a":"IP Address","q":"A unique string of numbers separated by periods."},"c82": {"a":"Java","q":"An object-oriented programming language developed by Sun Microsystems. It resembles C++, but was designed to avoid some of C++^s most notorious flaws."},"c83": {"a":"Kernel","q":"The central part in most computer operating systems for the management of the system^s resources and the communication between hardware and software components"},"c84": {"a":"Knowbot","q":"A program that will search a system or a network, such as the Internet, seeking and retrieving information on behalf of a user and reporting back when it has found it"},"c85": {"a":"LAN","q":"A network spanning a local area."},"c86": {"a":"Latency","q":"Measures the amount of time that it takes a message to go from its source to its destination."},"c87": {"a":"Legacy System","q":"An ^^antiquated^^ existing computer system or application program which continues to be used because the user does not want to replace or redesign it. Integration with newer systems may also be difficult because new software may use completely different technologies."},"c88": {"a":"Linux","q":"A free and open source Unix-like computer operating system. Unlike proprietary operating systems such as Windows or Mac OS, all underlying source code is available to the general public for anyone to use, modify, and redistribute freely."},"c89": {"a":"Loop Optimization","q":"Refers to the process in computer compiling to optimize loops in the programs. Most execution time of a scientific program is spent on loops. Thus a lot of compiler analysis and optimization techniques have been developed to make the execution of loops faster."},"c90": {"a":"Macintosh Operating System (Mac)","q":"A series of graphical user interface-based operating systems developed by Apple Computer for their Macintosh line of computer systems. It was first introduced in 1984 with the original Macintosh 128K."},"c91": {"a":"Memory","q":"The internal storage location where data and information is stored on a computer."},"c92": {"a":"Metadata","q":"Refers to information about data itself; perhaps the origin, size, formatting or other characteristics of a data item."},"c93": {"a":"Network","q":"A group of computers connected to each other in order to send and receive data."},"c94": {"a":"NSA","q":"A United States government institution that collects data for security purposes."},"c95": {"a":"Numerical Anaylsis","q":"The study of algorithms for the problems of continuous mathematics (as distinguished from discrete mathematics)."},"c96": {"a":"Operating System","q":"Provides the software platform required for various applications to run on."},"c97": {"a":"Packet","q":"The unit of data that is routed on a packet-switched network."},"c98": {"a":"Packet Switched Network","q":"The type of network in which relatively small units of data are routed through a network based on the destination address contained within each datagram."},"c99": {"a":"PDF","q":"The native file format for Adobe Systems^ Acrobat. Can describe documents containing any combination of text, graphics, and images in a device-independent and resolution independent format."},"c100": {"a":"Plug-in","q":"A type of computer programs that interacts with a main application (a web browser or an email program, for example) to provide a certain, usually very specific, function."},"c101": {"a":"Program","q":"In computer science, it is called software, applications program, or system software, and is an organized list of instructions that, when executed, causes the computer to behave in a predetermined manner."},"c102": {"a":"Port","q":"A connecting component that enables two computers to allow data sharing. Like a USB."},"c103": {"a":"Programming Language","q":"An artificial language that can be used to control the behavior of a machine (often a computer). Often have syntactic and semantic rules used to define meaning."},"c104": {"a":"RAM","q":"A configuration of storage cells that hold data. It can also be processed by a central processing unit."},"c105": {"a":"ROM","q":"It is a storage system that saves data permanently."},"c106": {"a":"Router","q":"A networking device that forwards data packets between computer networks."},"c107": {"a":"Software","q":"The programs used to direct the operations of a computer."},"c108": {"a":"TCP","q":"A connection-oriented transport layer protocol."},"c109": {"a":"TCP/IP","q":"The two main sets of protocols used to communicate across the internet."},"c110": {"a":"Website","q":"A location connected to the Internet that maintains one or more pages on the World Wide Web."},"c111": {"a":"URL","q":"The address of a website."},"c112": {"a":"Virus","q":"A program uploaded onto your computer by an unknown that hinders processes."},"c113": {"a":"Amplitude","q":"The height of a periodic wave which is a measure of its loudness."},"c114": {"a":"Analog representation","q":"Objects can take on any continuous value."},"c115": {"a":"Arithmetic overflow","q":"An attempt to represent an integer that exceeds the maximum allowable value."},"c116": {"a":"ASCII","q":"An acronym for the American Standard Code for Information Interchange; ASCII is an international standard for representing textual information in the majority of computers."},"c117": {"a":"Binary number system","q":"A base-2 positional numbering system."},"c118": {"a":"Bit","q":"A binary digit, 0 or 1."},"c119": {"a":"Bit depth","q":"The number of bits used to encode each sample during digitization."},"c120": {"a":"Boolean expression","q":"An expression that can evaluate only to true or false."},"c121": {"a":"Boolean logic","q":"A branch of mathematics which operates on the values true and false."},"c122": {"a":"Byte","q":"Eight bits."},"c123": {"a":"Circuit","q":"A collection of logic gates (1) that transforms a set of binary inputs into a set of binary outputs and (2) where the values of the outputs depend only on the current values of the inputs; more properly called a combinational circuit."},"c124": {"a":"Circuit construction algorithm","q":"An algorithm that allows us to go from a specification of what we wish to accomplish to a circuit that carries out those specifications."},"c125": {"a":"Circuit optimization","q":"The process of reducing the number of gates needed to implement a circuit."},"c126": {"a":"Compression ratio","q":"Measures how much a compression scheme has reduced the storage requirements of the data."},"c127": {"a":"Control circuit","q":"A circuit used to make decisions and control the flow of execution."},"c128": {"a":"Data Compression","q":"The process of reducing the number of bits required to represent a sound or image."},"c129": {"a":"Decoder","q":"A control circuit that has N input lines numbered 0, 1, 2, ..., N - 1 and 2N output lines numbered 0, 1, 2, 3, ..., 2N - 1."},"c130": {"a":"Digital representation","q":"The values for a given object are drawn from a finite set, such as the letters {A, B, C, ..., Z} or a subset of integer {0, 1, 2, 3, ..., MAX}"},"c131": {"a":"Digitized","q":"Converted from a continuous value to a single numeric value."},"c132": {"a":"Fault-Tolerant Computing","q":"The ability to continue functioning even in the presence of the failure of one or more components."},"c133": {"a":"Frequency","q":"The total number of cycles per unit time measure in cycles/second, also called hertz."},"c134": {"a":"Gate","q":"An electronic device that operates on a collection of binary inputs to produce a binary output."},"c135": {"a":"Gigabyte","q":"One billion bytes."},"c136": {"a":"Hardware design","q":"The process of designing the low level components of a computer, including arithmetic and control circuits"},"c137": {"a":"Logic design","q":"Another term for hardware design as it uses the capabilities of Boolean logic to carry out the design process."},"c138": {"a":"Lossless compression","q":"No information is lost in the compress, and it is possible to reproduce exactly the original data."},"c139": {"a":"Lossy compression","q":"Compress data in a way that does not guarantee that all the information in the original data can be fully ad completely recreated."},"c140": {"a":"Multiplexor","q":"A control circuit that has 2N input lines and 1 output line."},"c141": {"a":"Period","q":"The time it takes for a single wave in a periodic wave function"},"c142": {"a":"Positional Numbering System","q":"A numbering system in which each position of a number represents a value times the radix to a given power."},"c143": {"a":"Raster graphics","q":"A method for storing an image in which a sequence of picture elements is digitized and stored one row at a time, from left to right."},"c144": {"a":"RGB encoding scheme","q":"A method for encoding color that digitizes the contribution of the red, green, and blue components of each pixel"},"c145": {"a":"Sampling","q":"At fixed time intervals, the amplitude of a signal is measured and stored as an integer value; the wave is then represented in the computer in digital form as a sequence of sampled numerical amplitudes."},"c146": {"a":"Sampling Rate","q":"The time interval between sampling points."},"c147": {"a":"Scientific Notation","q":"A way to represent real numbers as a mantissa times a base to an exponential power."},"c148": {"a":"Sequential Circuit","q":"Circuit that contains feedback loops in which the output of a gate is fed back as input to an earlier gate."},"c149": {"a":"Sign/Magnitude notation","q":"A way to represent signed integer values in which one bit is used to represent the sign and the remaining bits are used to represent the magnitude."},"c150": {"a":"Transistor","q":"An electronic device that can be in an OFF state, which does not allow electricity to flow, or in an ON state, in which electricity can pass unimpeded; a transistor is a solid-state device that has no mechanical or moving parts."},"c151": {"a":"Truth Table","q":"A table that contains columns labeled inputs that list the possible combinations of true/false values."},"c152": {"a":"Two^s complement representation","q":"A way to represent signed integer in which we count up from zero to represent positive values and we count down from zero to represent negative values."},"c153": {"a":"Unicode","q":"Uses a 16-bit representation for characters."},"c154": {"a":"Agile software development","q":"An approach to software development that emphasizes a flexible and ready response to meet a shifting target."},"c155": {"a":"Benchmarking","q":"Running a program on many data sets to be sure its performance falls within required limits; timing the same algorithm on two different machines."},"c156": {"a":"Code library","q":"A collection of thoroughly tested object code for various useful tasks."},"c157": {"a":"Coding","q":"The process of translating the detailed designs into computer code."},"c158": {"a":"Divide-and-conquer","q":"A program design strategy in which tasks are broken down into subtasks, which are broken down into sub-subtasks, and so on, until each piece is small enough to code comfortably. These pieces work together to accomplish the total job."},"c159": {"a":"Empirical testing","q":"Designing a special set of test cases and running the program using these test data."},"c160": {"a":"Executable module","q":"The resulting object code after a linker inserts requested code from code libraries."},"c161": {"a":"External documentation","q":"Any materials assembled to clarify the program^s design and implementation."},"c162": {"a":"Feasibility study","q":"A step in the software development life cycle that evaluates a proposed project and compares the costs and benefits of various solutions."},"c163": {"a":"Integrated development environment (IDE)","q":"A collection of programs that support software development, such as debuggers, editors, toolkits, and libraries, that lets programmers perform several tasks within the shell of a single application."},"c164": {"a":"Integration testing","q":"After unit testing, integration testing is done to see that the modules communicate the necessary data between and among themselves and that all modules work together smoothly."},"c165": {"a":"Internal documentation","q":"Documentation that is part of the program code itself."},"c166": {"a":"Logic error","q":"An error in the algorithm used to solve a problem."},"c167": {"a":"Object code","q":"Machine language instructions."},"c168": {"a":"Pair programming","q":"Involves two programmers at a single workstation. At any given point in time, one is writing code and the other is actively observing, watching for possible errors but also thinking about the overall approach."},"c169": {"a":"Problem specification","q":"A step in the software development life cycle that involves developing a clear, concise, and unambiguous statement of the exact problem the software is to solve."},"c170": {"a":"Procedural language","q":"A program written in a procedural language consists of sequences of statements that manipulate data items."},"c171": {"a":"Program design phase","q":"A step in the software development life cycle that plans the structure of the software to be written."},"c172": {"a":"Program maintenance","q":"The process of adapting an existing software product due to errors, new system requirements, or changing user needs."},"c173": {"a":"Program verification","q":"Used to prove that if the input data to a program satisfies certain conditions, then, after the program has been run on these data, the output data satisfies certain other conditions."},"c174": {"a":"Regression testing","q":"If anything is changed on an already-tested module, regression testing is done to be sure that this change has not introduced a new error into code that was previously correct."},"c175": {"a":"Runtime error","q":"An error that occurs when the program is run using certain sets of data that result in some illegal operation, such as dividing by zero."},"c176": {"a":"Semantics","q":"The meaning of correctly written programming statements."},"c177": {"a":"Source code","q":"High-level language instructions."},"c178": {"a":"Syntax error","q":"An error that occurs because a program statement fails to follow the correct rules of syntax."},"c179": {"a":"Technical documentation","q":"Documentation that enables programmers who later have to modify the program to understand the code."},"c180": {"a":"Third-generation language","q":"Another name for high-level programming language as opposed to machine language (first generation) or assembly language (second generation)."},"c181": {"a":"Top-down decomposition","q":"A program design strategy in which tasks are broken down into subtasks, which are broken down into sub-subtasks, and so on, until each piece is small enough to code comfortably. These pieces work together to accomplish the total job."},"c182": {"a":"Syntax","q":"The rules for exactly how programming statements must be written; the grammatical structure of a programming language"},"c183": {"a":"Application","q":"(Java) A complete standalone program that resides and runs on a self-contained computer."},"c184": {"a":"External library","q":"A well-written, efficient, and thoroughly tested code module that is separately compiled and then drawn on by any program that wishes to use its capabilities."},"c185": {"a":"Functional programming languages","q":"Views every task in terms of functions. In this context, function means something like a mathematical function—a recipe for taking an argument (or possibly several arguments) and doing something with them to compute a single value."},"c186": {"a":"Knowledge base","q":"Facts and rules about a certain domain of interest."},"c187": {"a":"Open source","q":"Software whose source code is freely available and may be used, distributed, or modified by anyone."},"c188": {"a":"Recursive","q":"Something that is defined in terms of ^^smaller versions^^ of itself."},"c189": {"a":"Computational model","q":"A model constructed using algorithmic procedures implemented as computer programs."},"c190": {"a":"Computational steering","q":"A procedure for using a computational model to improve the design of an actual system by continually resetting model parameters to improve system performance."},"c191": {"a":"Computer graphics","q":"The field of computer science that examines the technical problems of displaying visual images on a computer screen."},"c192": {"a":"Continuous model","q":"A model of a system using mathematical equations that describe system performance as a continuous function of time t."},"c193": {"a":"Discrete event simulation","q":"A computational modeling technique that simulates the behavior of a system only at discrete points in time."},"c194": {"a":"Garbage in, garbage out","q":"The term for the fact that the output coming out of a computer model is only as accurate as the assumption used to build the model."},"c195": {"a":"Scientific visualization","q":"The use of images and visualization techniques to make scientific data easier to interpret and understand."},"c196": {"a":"Simulation model","q":"Another term for a computational model."},"c197": {"a":"Statistical distribution","q":"This is a mathematical function that describes the probability of a random quantity taking on certain values."},"c198": {"a":"Stochastic components","q":"Parts of a model that display random behavior."},"c199": {"a":"Uniform random number","q":"Every value in the range from a to b has the same chance of occurring."},"c200": {"a":"Analogy","q":"Arguing about a problem by comparing it to a related problem, which you claim is very similar in terms of its ethical implications and consequences."},"c201": {"a":"Consequentialism","q":"A school of thought in ethics that focuses on the consequences of an act to determine if the act is good or bad."},"c202": {"a":"Cyberbullying","q":"Humiliating, taunting, threatening or invading someone^s privacy using the Internet, Web, or other type of electronic technology."},"c203": {"a":"Ethics","q":"The study of how to decide if something is morally right or wrong."},"c204": {"a":"Hacktivism","q":"Hacking that is intended as political activism."},"c205": {"a":"Peer-to-peer file sharing","q":"The sharing of files between two equal participants on a network. This is distinct from the client-server model in which the two sides serve very different roles--one side only sending information (the server) and the other side only receiving information (the client)."},"c206": {"a":"Computer science","q":"The study of algorithms, including their mathematical properties, hardware and linguistic realizations, and their applications."},"c207": {"a":"Computing agent","q":"The entity (machine, robot, person, or thing) that executes the steps of an algorithm."},"c208": {"a":"High-level programming language","q":"A programming language that uses both natural language constructs and mathematical notation."},"c209": {"a":"Infinite loop","q":"The repetitive execution of a block of operations that will never end. This is a fatal error when it occurs in an algorithm."},"c210": {"a":"Sequential operation","q":"An algorithmic operation that carries out a single task and then moves on to the next operation in sequence."},"c211": {"a":"Algorithm discovery","q":"The process of finding an algorithmic solution to a given problem. Computation: An algorithmic operation that carries out a single numeric computation and stores the result."},"c212": {"a":"Computation","q":"An algorithmic operation that carries out a single numeric computation and stores the result."},"c213": {"a":"Conditional statements","q":"Operations that ask a question and select the next instruction to carry out based on the answer to that question."},"c214": {"a":"Continuation condition","q":"The true/false condition that will determine when the iteration has been completed."},"c215": {"a":"Control operations","q":"Operations that alter the normal sequential flow of control within an algorithm."},"c216": {"a":"Input","q":"An operation that causes data values from the outside world to be brought into the algorithm."},"c217": {"a":"Iteration","q":"The repetitive execution of a block of operations."},"c218": {"a":"Output","q":"An operation that causes computed values to be sent to the outside world for viewing or saving."},"c219": {"a":"Primitive operation","q":"An operation that can be directly understood by the computing agent executing the algorithm and which does not have to be further clarified or explained."},"c220": {"a":"Pseudocode","q":"A notation used to design algorithms. It uses English constructs, mathematical notation and an informal algorithmic structure designed to look like a high-level programming language."},"c221": {"a":"Sorting","q":"The task of putting a list of values into numeric or alphabetical order."},"c222": {"a":"Boolean expression","q":"An expression that can evaluate only to true or false."},"c223": {"a":"Gigabyte","q":"One billion bytes."},"c224": {"a":"Program","q":"an algorithm that is written in a programming language that runs on a computer"},"c225": {"a":"Control Structures","q":"a block of programming that determines which part of the program is executed next. There are three types of structures: sequence, selection, and repetition."},"c226": {"a":"Computational Artifact","q":"an object created by a human being that involves the use of computation in some way, for example a mobile app or a web page."},"c227": {"a":"Event Driven Programming","q":"a programming approach whereby the program^s behavior is controlled by writing code that responds to various events that occur, such as Button clicks."},"c228": {"a":"Hardware","q":"the large and small physical components that make up a computers such as the computer^s keyboard or its processor."},"c229": {"a":"Software","q":"the computer programs that make up a computer system such as the mobile apps we will be creating in this course."},"c230": {"a":"Abstraction","q":"one of the seven big ideas of the CS Principles curriculum. An abstraction is a simplified and general representation of some complex object or process. One example --we^ll encounter many in this course, including abstractions used in computer programming -- would be a Google map."},"c231": {"a":"Binary Number","q":"a number written in the binary system, a system that uses only two digits, 0s and 1s."},"c232": {"a":"Blacklist","q":"in internet terminology, a generic term for a list of email addresses or IP addresses that are origination with known spammers"},"c233": {"a":"Character","q":"any symbol that requires one byte of storage"},"c234": {"a":"Cyberspace","q":"a metaphor for describing the non-physical terrain created by computer systems"},"c235": {"a":"Data","q":"data is distinct information that is formatted in a special way. Data exists in a variety of forms, like text on paper or bytes stored in electronic memory"},"c236": {"a":"Data Center","q":"are physical or virtual infrastructures used by enterprises to house computer, server and networking systems and components for the company^s IT (information technology) needs"},"c237": {"a":"Data Network","q":"a telecommunications network which allows computers to exchange data"},"c238": {"a":"Disk Drive","q":"a randomly addressable and rewritable storage device"},"c239": {"a":"Intellectual Property","q":"refers to any property that is created using original thought. Traditional intellectual property include patents, copyrights, and trademarks."},"c240": {"a":"Network","q":"a group of two or more computer systems linked together"},"c241": {"a":"Processor","q":"short for microprocessor or CPU"},"c242": {"a":"Social Networking","q":"a social structure made of nodes that are generally individuals or organizations. A social network represents relationships and flows between people, groups, organizations, animals, computers, or other information/knowledge processing entities"},"c243": {"a":"Whitelist","q":"a generic name for a list of email address or IP addresses that are considered to be spam free"},"c244": {"a":"Analog","q":"a device or system that represents changing values as continuously variable physical quantities"},"c245": {"a":"ASCII","q":"a code for representing English characters as numbers, with each letter assigned a number from 0 to 127"},"c246": {"a":"Cloud Computing","q":"comparable to grid computing, cloud computing relies on sharing resources rather than having local servers handle applications."},"c247": {"a":"Cryptography","q":"the art of protecting information by transforming it into an unreadable format, called cipher text"},"c248": {"a":"Digital","q":"any system based on discontinuous data or events. Computers are digital machines because at the basic level they can distinguish between just two values, 0 and 1."},"c249": {"a":"Digital Signal Processing","q":"(DSP) refers to manipulating analog information"},"c250": {"a":"Download","q":"to copy data (usually an entire file) from a main source to a peripheral device"},"c251": {"a":"Megabyte","q":"used to describe data storage, 1,048,576 bytes (abbreviated MB)"},"c252": {"a":"Megapixel","q":"one million pixels, used in reference to the resolution of a graphics device"},"c253": {"a":"Modeling","q":"process of representing a real-world object of phenomenon as a set of mathematical equations."},"c254": {"a":"OCR","q":"optical character recognition, the branch of computer science that involves reading text from paper and translating the images into a form that the computer can manipulate"},"c255": {"a":"Raster","q":"the rectangular area of a display screen actually being used to display images"},"c256": {"a":"Render","q":"refers to the process of adding realism to a computer graphics by adding 3-D qualities, such as shadows and variations in color and shade."},"c257": {"a":"Spam","q":"spam is electronic junk mail or junk newsgroup postings"},"c258": {"a":"Steganography","q":"the art and science of hiding information by embedding messages within other, seemingly harmless messages"},"c259": {"a":"Upload","q":"to transmit data from a computer to a bulletin board service, mainframe, or network."},"c260": {"a":"Bit","q":"Single unit of information on a computer represent as a 0 or 1"},"c261": {"a":"Bit Rate","q":"The number of bits that are conveyed or processed per unit of time"},"c262": {"a":"Latency","q":"The time it takes for a signal to arrive"},"c263": {"a":"Bandwidth","q":"Transmission capacity, measured by bit rate"},"c264": {"a":"Fiberoptics","q":"Method of transmitting data that utilizes light"},"c265": {"a":"Copper Wire","q":"Method of transmitting data that utilizes electricity"},"c266": {"a":"WiFi","q":"A wireless networking technology that utilizes radio waves to transmit information/data"},"c267": {"a":"Prototype","q":"A preliminary sketch of an idea or model for something new. It^s the original drawing from which something real might be built or created."},"c268": {"a":"IP Address","q":"A number assigned to any item that is connected to the Internet."},"c269": {"a":"Packets","q":"Small chunks of information that have been carefully formed from larger chunks of information."},"c270": {"a":"Router","q":"A computer which receives messages travelling across a network and redirects them towards their intended destinations based on the addressing information included with the message."},"c271": {"a":"Transmission Control Protocol (TCP)","q":"Provides reliable, ordered, and error-checked delivery of a stream of packets on the internet. TCP is tightly linked with IP and usually seen as TCP/IP in writing."},"c272": {"a":"Domain Name System (DNS)","q":"An abbreviation for Domain Name System, the Internet^s system for converting alphabetic names into numeric IP addresses."},"c273": {"a":"Hypertext Transfer Protocol (HTTP)","q":"The protocol used by the World Wide Web. It describes how messages are formatted and interchanged, and how web servers respond to commands."},"c274": {"a":"Server","q":"A computer that awaits and responds to requests for data."},"c275": {"a":"Client","q":"A computer that requests data stored on a server."},"c276": {"a":"Net Neutrality","q":"The principle that Internet service providers should enable access to all content and applications regardless of the source, and without favoring or blocking particular products or websites."},"c277": {"a":"Internet Censorship","q":"The control or suppression of what can be accessed, published, or viewed on the Internet. It may be carried out by governments or by private organizations at the behest of government, regulators, or on their own initiative."},"c278": {"a":"Node","q":"Vertex; Represented by a labeled circle"},"c279": {"a":"Edge","q":"A line connecting two nodes"},"c280": {"a":"Cost","q":"Weight; The number associated with an edge that indicates distance, time, or estimated cost"},"c281": {"a":"Cycle","q":"A set of edges that begin at one node and can be followed through other nodes back where you started"},"c282": {"a":"Efficiency","q":"A measure of the number of steps per input size needed to complete an algorithm"},"c283": {"a":"Routing Table","q":"A data table stored in a router that lists the routes to particular network destinations"},"c284": {"a":"Minimum Spanning Tree","q":"Dictates the shortest aggregate path from one node to every node  A spanning tree connecting all nodes together with the minimum aggregate value of its edges."},"c285": {"a":"Internet Engineering Task Force (IETF)","q":"A group of volunteers, private citizens, government officials, etc. who promote internet standards"},"c286": {"a":"Algorithm","q":"A precise sequence of instructions for processes that can be executed by a computer"},"c287": {"a":"Function","q":"A piece of code that you can easily call over and over again."},"c288": {"a":"API","q":"a collection of commands made available to a programmer"},"c289": {"a":"Documentation","q":"a description of the behavior of a command, function, library, API, etc."},"c290": {"a":"Parameter","q":"An extra piece of information that you pass to the function to customize it for a specific need"},"c291": {"a":"For Loop","q":"A particular kind of looping construct provided in many languages. Typically, a for loop defines a counting variable that is checked and incremented on each iteration in order to loop a specific number of times."},"c292": {"a":"Loop","q":"The action of doing something over and over again."},"c293": {"a":"Byte","q":"technical term for 8 bits of data"},"c294": {"a":"Kilobyte (KB)","q":"1000 bytes"},"c295": {"a":"Megabyte (MB)","q":"1,000 kilobytes"},"c296": {"a":"Terabyte (TB)","q":"1,000 gigabytes"},"c297": {"a":"Petabyte (PB)","q":"1,000 terabytes"},"c298": {"a":".bmp","q":"(bitmap image file or bitmap) is a raster graphics image file format used to store digital images."},"c299": {"a":".gif","q":"(acronym for Graphics Interchange Format) a bitmap image format which uses the LZW lossless data compression technique to reduce the file size without degrading the visual quality. Supports 8 bits per pixel for each image and animations."},"c300": {"a":".jpg or .jpeg","q":"(acronym for Joint Photographic Experts Group), a commonly used lossy compression format for digital images, particularly for those images produced by digital photography. The format supports adjustable degrees of compression."},"c301": {"a":".mp3","q":"an audio coding format for digital audio which uses a form of lossy data compression which works by reducing (or approximating)  certain components of the audio that are considered to be beyond audible human hearing."},"c302": {"a":".wav","q":"(Waveform Audio File Format) an audio coding format standard for storing an audio bitstream of uncompressed audio data."},"c303": {"a":".txt","q":"a computer format that is structured as a sequence of lines of electronic text."},"c304": {"a":".zip","q":"an archive file format that supports lossless data compression; may contain one or more files or directories."},"c305": {"a":".png","q":"(Portable Network Graphics) a raster graphics file format that supports lossless data compression."},"c306": {"a":"Heuristic","q":"a problem solving approach (algorithm) to find a satisfactory solution where finding an optimal or exact solution is impractical or impossible."},"c307": {"a":"Image","q":"A type of data used for graphics or pictures."},"c308": {"a":"Metadata","q":"Data that describes other data. For example, a digital image my include metadata that describe the size of the image, number of colors, or resolution."},"c309": {"a":"Pixel","q":"Short for ^^picture element^^ it is the fundamental unit of a digital image, typically a tiny square or dot which contains a single point of color of a larger image."},"c310": {"a":"Hexadecimal Number System","q":"A number system consisting of 16 distinct symbols — 0-9 and A-F — which can occur in each place value."},"c311": {"a":"Lossless","q":"A compression scheme in which every bit of the original data can be recovered from the compressed file."},"c312": {"a":"Lossy","q":"A compression scheme in which ^^useless^^ or less-than-totally-necessary information is thrown out in order to reduce the size of the data. The eliminated data is unrecoverable."},"c313": {"a":"RGB","q":"the color model that uses varying intensities of (R)ed, (G)reen, and (B)lue light added together in order to reproduce a broad array of colors."},"c314": {"a":"File extensions","q":"the endings of file names that indicate to the computer the format for how the underlying bits are organized."},"c315": {"a":"Computationally Hard Problem","q":"A problem that can not be solved in a reasonable amount of time. Heuristics are often used to create an approximate or good enough solution."},"c316": {"a":"Innovation","q":"A novel or improved idea, device, product, etc. or the development thereof"},"c317": {"a":"Moore^s Law","q":"the observation that computing power roughly doubles every two years."},"c318": {"a":"Big Data","q":"a broad term for datasets so large or complex that traditional data processing applications are inadequate."},"c319": {"a":"Cipher","q":"the generic term for a technique (or algorithm) that performs encryption"},"c320": {"a":"Cracking encryption","q":"When you attempt to decode a secret message without knowing all the specifics of the cipher."},"c321": {"a":"Decryption","q":"a process that reverses encryption, taking a secret message and reproducing the original plain text"},"c322": {"a":"Encryption","q":"a process of encoding messages to keep them secret, so only ^^authorized^^ parties can read it."},"c323": {"a":"Asymmetric encryption","q":"used in public key encryption, it is scheme in which the key to encrypt data is different from the key to decrypt."},"c324": {"a":"Public Key Encryption","q":"Used prevalently on the web, it allows for secure messages to be sent between parties without having to agree on, or share, a secret key. It uses an asymmetric encryption scheme in which the encryption key is made public, but the decryption key is kept private."},"c325": {"a":"Digital Divide","q":"the gulf between those who have ready access to computers and the Internet, and those who do not."},"c326": {"a":"Hypothesis","q":"A proposed explanation for some phenomenon used as the basis for further investigation."},"c327": {"a":"Search Trends","q":"Comparison of the popularity of topical queries in an online search engine as they relate to time."},"c328": {"a":"Visualization","q":"Images, diagrams, tables, etc created from information extracted from a given data set, with the express intention of highlighting a data story."},"c329": {"a":"Pivot Table","q":"The name of the tool used by most spreadsheet programs to create a summary table."},"c330": {"a":"README","q":"A document providing background information about a dataset."},"c331": {"a":"CSV","q":"Abbreviation of ^^comma-separated values,^^ this is a widely-used format for storing data."},"c332": {"a":"Raw data","q":"The original data as it was collected."},"c333": {"a":"Summary table","q":"A table of aggregate information about a dataset (e.g., the average, sum, count of some values)."},"c334": {"a":"Filter","q":"tool/technique using dynamic parameters for reducing a data set to viewing only similar items in a row or column."},"c335": {"a":"Aggregation","q":"A computation in which rows from a data set are grouped together and used to compute a single value of more significant meaning or measurement. Common aggregations include: Average, Count, Sum, Max, Median, etc."},"c336": {"a":"Binary question","q":"a question where there are only two possible answers"},"c337": {"a":"Protocol","q":"A set of rules governing the exchange or transmission of data between devices."},"c338": {"a":"ASCIII","q":"The universally recognized raw text format that any computer can understand"},"c339": {"a":"American Standard Code for Information Interchange","q":"What does ASCII stand for? (cap first letter)"},"c340": {"a":"code","q":"(slang) to write instructions for a computer"},"c341": {"a":"Redundancy","q":"repetition of information or the inclusion of additional information to reduce errors in transmission."},"c342": {"a":"DNS","q":"The service that translates URL^s to IP addresses"},"c343": {"a":"Domain name service","q":"DNS stands for..."},"c344": {"a":"HTTP","q":"the protocol used for transmitting web pages over the internet"},"c345": {"a":"Hypertext transfer protocol","q":"HTTP stands for..."},"c346": {"a":"TCP","q":"provides reliable, ordered and error checked delivery of a stream of packets in the internet"},"c347": {"a":"URL","q":"an easy to remember address for calling a web page"},"c348": {"a":"Octal","q":"The octal number system is base 8, using only digits 0 through 7."},"c349": {"a":"Decimal","q":"Traditional number system using digits 0-9."},"c350": {"a":"Iterative innovation","q":"Incremental or small improvement to an item"},"c351": {"a":"Novel innovation","q":"Improvement that is new, creative and has not been done before ^^outside the box thinking.^^"},"c352": {"a":"Vint Cerf","q":"Internet pioneer who believed the Internet should be free and available to everyone"},"c353": {"a":"Higher lower","q":"__________ level protocols use _______ levels without needing to understand precisely how they work. (space between each term)"},"c354": {"a":"Lower higher","q":"_________ level protocols guarantee __________ level protocols will function without stating specifically how this will be accomplished."},"c355": {"a":"Creative Commons","q":"one of several public copyright licenses that enable the free distribution of an otherwise copyrighted work. A CC license is used when an author wants to give people the right to share, use, and build upon a work that they have created."},"c356": {"a":"High Level Programming Language","q":"A programming language that enables a programmer to write programs that are more or less independent of a particular type of computer. Such languages are considered high-level because they are closer to human languages and further from machine languages. Examples: JavaScript, Java, FORTRAN"},"c357": {"a":"Low Level Programming Language","q":"A programming language that provides little or no abstraction from a computer^s instruction set architecture—commands or functions in the language map closely to processor instructions. Generally this refers to either machine code or assembly language."},"c358": {"a":"Fault tolerant network","q":"The ability to route around broken servers on the internet."},"c359": {"a":"Global Variable","q":"A variable whose scope is ^^global^^ to the program, it can be used and updated by any part of the code. Its global scope is typically derived from the variable being declared (created) outside of any function, object, or method."},"c360": {"a":"If Statement","q":"The common programming structure that implements ^^conditional statements^^."},"c361": {"a":"Local Variable","q":"A variable with local scope is one that can only be seen, used and updated by code within the same scope. Typically this means the variable was declared (created) inside a function; includes function parameter variables."},"c362": {"a":"Callback function","q":"a function specified as part of an event listener; it is written by the programmer but called by the system as the result of an event trigger."},"c363": {"a":"Event","q":"An action that causes something to happen."},"c364": {"a":"User Interface","q":"The visual elements of an program through which a user controls or communications the application. Often abbreviated UI."},"c365": {"a":"Data Type","q":"(ex: Number, Boolean, or String) a value^s property that dictates how the computer will interpret it. For example 7+5 is interpreted differently from ^^7^^+^^5^^"},"c366": {"a":"Expression","q":"Any valid unit of code that resolves to a value."},"c367": {"a":"Variable","q":"A placeholder for a piece of information that can change."},"c368": {"a":"Debugging","q":"Finding and fixing problems in your algorithm or program."},"c369": {"a":"Conditionals","q":"statements that run under only certain conditions"},"c370": {"a":"Selection","q":"A generic term for a type of programming statement (usually an if-statement) that uses a Boolean condition to determine, or select, whether or not to run a certain block of statements."},"c371": {"a":"Concatentate","q":"to link together or join. Typically used when joining together text Strings in programming (e.g. ^^Hello, ^^+name)"}}}  