{"title":"World Religion Background information","cards":{"c0": {"a":"Purification","q":"Washing, confessing, fasting, removal of clothing, fire, etc."},"c1": {"a":"Faith","q":"Deeply personal relationship that we have with what we consider to be sacred in life. It is the point where there are values in life worth living of dying for."},"c2": {"a":"Religion","q":"Everything we do to celebrate our faith publicly through worship."},"c3": {"a":"Worship","q":"Our need and capacity to transcend our worldly existence and reflect on ultimate reality"},"c4": {"a":"Imitative Magic","q":"Based on the belief that look alikes act alike...(if someone imitates looks and actions of another, they can bring about the like action in another.)"},"c5": {"a":"Black Magic","q":"This is equated with witchcraft, curses, or voodoo. Dark, manipulative magic rituals."},"c6": {"a":"Contagious Magic","q":"This is based on the notion that once things are joined, they will retain a magical sympathy even after separation. (think of cutting hair, clipping fingernails, or the cannibalistic eating of organs to acquire strength or character"},"c7": {"a":"Aversive Magic","q":"This is when communities try to rid themselves of guilt by transferring it to a scapegoat. (ie. load ^^guilt^^ in a boat and set it adrift."},"c8": {"a":"Sacrifices","q":"This can be animal, human, first fruits...given or burned to  god/God."},"c9": {"a":"Fetish","q":"lucky charm, talisman, amulet"},"c10": {"a":"Shaman","q":"Controlling spirits through a Witchdoctor, or medicine man"},"c11": {"a":"Revelation","q":"Sudden or astonishing burst of insight that changes our outlook...the aha moment!!"},"c12": {"a":"Salvation","q":"The power of the human spirit to overcome disaster and even death."},"c13": {"a":"Theology","q":"Study of God"},"c14": {"a":"Philosophy","q":"Study of wisdom"},"c15": {"a":"Idealism","q":"Originated with Plato. A systematic theory that maintains that the ^^real world^^ is the nature of thought and a copy of the ^^ideal world^^ is of a higher, spiritual nature. It is a tendency to represent things in an IDEAL form."},"c16": {"a":"Materialism","q":"This states that the only thing that really exists is matter. All things are composed of material interactions. A materialist may stress the ^^material^^ over the spiritual."},"c17": {"a":"Individualism","q":"Political and social philosophy that places high value on freedom and choice. The interests of each person are best served by allowing maximum freedom for choosing and achieving your own goals."},"c18": {"a":"Collectivism","q":"Here the individual is subordinate to the social collectivity such as a state, nation, race, or social class"},"c19": {"a":"Community","q":"A social unit that shares common values"},"c20": {"a":"Phlegmatic","q":"This temperament is is relaxed, quiet...maybe even a little lazily sluggish. They accepting and affectionate...think of a bassett hound!!!"},"c21": {"a":"Choleric","q":"Ambitious, leader-like, passion and agression. Charismatic leader...political. Think German Shepherd"},"c22": {"a":"Sanguine","q":"Impulsive, pleasure seeking...sociable and charismatic. Creative...sometimes forgetful....think Scooby Doo!"},"c23": {"a":"Melancholic","q":"Introverted, thoughtful. Easily affected by burdens of the world. Perfectionist. Think CAT!"}}}  