{"title":"jpush exam","cards":{"c0": {"a":"teapot dome","q":"1922 Scandal of Harding administration: secretary (Albert B.fall) leased lands to private interests that contained navy oil reserves in return for bribes."},"c1": {"a":"supply-side economics","q":"when taxes are high people don^t have money to spend on extra items (like in businesses, cars) when taxes are low people have more in money in pockets to help better the economy"},"c2": {"a":"Isolationism","q":"A national policy of avoiding involvement in world affairs"},"c3": {"a":"mass production","q":"Large scale manufacturing done with machinery increased supply and lowered cost"},"c4": {"a":"assembly line","q":"divided operations into simple tasks and cut unnecessary motion to a minimum Henry ford"},"c5": {"a":"Model T","q":"A cheap and simple car designed by Ford. It allowed for more Americans to own a car. ^^tin Lizzie^^ ^^Flivver^^"},"c6": {"a":"Nativism","q":"a belief that one^s native land needs to be protected against immigrants"},"c7": {"a":"anarchists","q":"people who oppose all forms of organized government"},"c8": {"a":"Klu Klux Klan","q":"organization that promotes hatred and discrimination against specific ethnic and religious groups order to preserver a white protestant civilization"},"c9": {"a":"National Origins Act","q":"made immigration restriction a permanent policy. Quota set at 2% of each national group represented in 1890."},"c10": {"a":"evolution","q":"human being develop from lower from of life over the course of millions of years."},"c11": {"a":"Creationism","q":"the belief that God created the world as described in the Bible"},"c12": {"a":"Speakeasies","q":"Secret bars where alcohol could be purchased illegally during prohibition"},"c13": {"a":"mass media","q":"Television, radio, newspapers, magazines, the Internet, and other means of popular communication and entertainment. helped unify the nation"},"c14": {"a":"jazz","q":"a style of music influenced by dixieland blues and ragtime with syncopated rhythms and improve elements"},"c15": {"a":"Great Migration","q":"Movement of African Americans from the South to the North for jobs. seeking to escape southern segregations and join black communities"},"c16": {"a":"Harlem Renaissance","q":"flowering of African American arts in the 1920. developed racial pride and African American arts New York"},"c17": {"a":"Bull Market","q":"a period of rising stock prices (America before the crash)"},"c18": {"a":"stock market","q":"A system for buying and selling shares of companies"},"c19": {"a":"Black Tuesday","q":"October 29 1929, steepest dive in market. 16 million shares sold. market lost 10-15 billion in value"},"c20": {"a":"bank runs","q":"when depositors withdraw all their money from banks (in fear the banks were going to crash with the market)"},"c21": {"a":"Hobos","q":"Homeless wanderers who often rode the rails (sometimes left families out of desperateness)"},"c22": {"a":"Dust Bowl","q":"drought in the Great Plains from the Dakotas to texas forcing farmers out of work and moving to California"},"c23": {"a":"Public works","q":"government financed building projects (broke hoovers policies of issuing relief)"},"c24": {"a":"relief","q":"money given directly to impoverished families"},"c25": {"a":"foreclosed","q":"Loss of property due to nonpayment of the mortgage (couldn^t afford)"},"c26": {"a":"Bonus Army","q":"Group of WWI vets. that marched to D.C. in 1932 to demand the immediate payment of their goverment war bonuses in cash"},"c27": {"a":"New Deal","q":"Roosevelt^s policies for ending the Depression"},"c28": {"a":"bank holidays","q":"Closing the remaining banks before bank runs could put them out of business"},"c29": {"a":"hundred days","q":"Congress passed 15 major acts to resolve the economic crisis of the Great Depression"},"c30": {"a":"Fireside Chats","q":"radio broadcasts made by FDR to the American people to explain his initiatives"},"c31": {"a":"Agricultural Adjustment Act","q":"act in which the government paid some farmers to not raise certain crops, livestock or dairy products in effort to raise the prices of produce."},"c32": {"a":"Federal Deposit Insurance Corporation (FDIC)","q":"the government agency that insures customer deposits if a bank fails came from FDR^s new deal"},"c33": {"a":"Civilian Conservation Corps","q":"offered young men (18-25) the opportunity to work in the forestry service (fighting forest fires) in attempt to put people back in work"},"c34": {"a":"Works Progress Administration","q":"Program of the New Deal to perform public works to put people back to work. largest publics works program of the new deal"},"c35": {"a":"Social Security Act","q":"created a tax on workers and employers. That money provided monthly pensions for retired people. made to provide security for older Americans and unemployed workers"},"c36": {"a":"safety net","q":"safeguards and relief programs that protected them against economic disaster"},"c37": {"a":"Fascism","q":"an aggressive nationalistic movement that considered the nation more important than the individual"},"c38": {"a":"Axis Powers","q":"Germany, Italy, Japan"},"c39": {"a":"Internationalism","q":"the idea that trade between nations creates prosperity and helps prevent war (fDR^s belief)"},"c40": {"a":"appeasement","q":"the policy of giving concessions in exchange for peace."},"c41": {"a":"Blitzkrieg","q":"^^Lighting war^^, typed of fast-moving warfare used by German forces against Poland in 1939"},"c42": {"a":"battle of Britain","q":"A series of battles between German and British air forces, fought over Britain in fall of 1940"},"c43": {"a":"Lend-Lease Act","q":"allowed America to lend or lease arms to any country considered vital to defense. loop hole of neutrality when Britain ran out of money"},"c44": {"a":"Atlantic Charter","q":"committed the us and Britain to a postwar democracy, nonaggression , free trade, economic advancement and freedom of seas"},"c45": {"a":"Double V Campaign","q":"urged African Americans to support the war to achieve a double victory over both Hitler^s racism abroad and the racism at home"},"c46": {"a":"cost-plus contract","q":"a government contract to pay a manufacturer the cost to produce an item plus a guaranteed percentage"},"c47": {"a":"Tuskegee Airmen","q":"famous segregated unit of African-American pilots never lost a man"},"c48": {"a":"japaneese internment","q":"Americans put Japanese in camps in California in fear that they were says after the Japanese attack on Pearl Harbor"},"c49": {"a":"Rationing","q":"Limiting the purchase of many products to make sure enough were available for military use"},"c50": {"a":"Victory Gardens","q":"gardens planted to produce more food for the war effort"},"c51": {"a":"VE Day","q":"May 8, 1945, Victory in Europe day"},"c52": {"a":"Manhattan Project","q":"American program to build an atomic bomb"},"c53": {"a":"warren harding","q":"president elected in 1921 for his ^^return to normalcy^^ policy after wwI he was easygoing  put ^^Ohio gang^^ in office"},"c54": {"a":"Calvin Coolidge","q":"Became president when Harding died of pneumonia. He was known for practicing a rigid economy in money and words, and acquired the name ^^Silent Cal^^ for being so soft-spoken. He was a true republican and industrialist. Believed in the government supporting big business."},"c55": {"a":"Henry Ford","q":"United States manufacturer of automobiles who pioneered mass production (1863-1947). assembly line"},"c56": {"a":"Charles Lindbergh","q":"American pilot who made the first non-stop flight across the Atlantic Ocean."},"c57": {"a":"Al Capone","q":"gangster in Chicago during Prohibition opened illegal speakeasies"},"c58": {"a":"Charlie Chaplin","q":"popular silent film star in the 1920^s"},"c59": {"a":"Babe Ruth","q":"THE BEST BASE BALL PLAYER IN THE HISTORY OF BASEBALL PLAYERS -mr jeddings. used media to make money"},"c60": {"a":"Jack Dempsey","q":"Famous boxer in the 1920"},"c61": {"a":"Langston Hughes","q":"poet known for his voice of the African American in America"},"c62": {"a":"Alfred E. Smith","q":"Democratic presidential candidate in 1928  Roman Catholic  four time governor of New York ran against hoover"},"c63": {"a":"Herbert Hoover","q":"republic candidate in 1928 against Alfred smith won  quaker"},"c64": {"a":"Franklin D. Roosevelt","q":"President of the US during Great Depression and World War II ran for 3 terms new deal didn^t like neutrality"},"c65": {"a":"Huey P. Long","q":"A presidential candidate in the 1936 election known for his Share the Wealth program. He and other demagogues pushed FDR to move the New Deal to help people directly."},"c66": {"a":"Benito Mussolini","q":"dictator who brought fascism to italy black shirts joined hitler"},"c67": {"a":"Joseph Stalin","q":"Russian leader who succeeded Lenin as head of the Communist Party and created a totalitarian state by purging all opposition  non aggression pact"},"c68": {"a":"Adolf Hitler","q":"German Nazi dictator during World War II  started wwii  mein kamf"},"c69": {"a":"Winston Churchill","q":"Prime Minister of Great Britain during WWII inspired the people"},"c70": {"a":"harry s truman","q":"Became president when FDR died; gave the order to drop the atomic bomb"}}}  